Revit 2027 API
CodeCheckingParameterServiceData.GetCurrentElements Method
 Returns the list of Ids of the current elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetCurrentElements()
Public Function GetCurrentElements As IList(Of ElementId)
public:
IList<ElementId^>^ GetCurrentElements()
member GetCurrentElements : unit -> IList<ElementId>
Return Value
IList<ElementId>
 Ids of the current elements. Contains the analytical model element to which the code checking parameter belongs.
See Also
Reference
CodeCheckingParameterServiceData Class
Autodesk.Revit.DB.Structure Namespace